{
  "recipes": [
    {
      "id": "kimbap",
      "name": "Kimbap (Korean Seaweed Rice Rolls)",
      "type": "lunch",
      "description": "Kimbap is a popular Korean dish consisting of rice, vegetables, and sometimes meat, all rolled in seaweed. It's an excellent option for batch cooking as you can prepare multiple rolls at once and store them for daily consumption throughout the week.",
      "prepTime": 45,
      "cookTime": 15,
      "servings": 5,
      "ingredients": [
        {
          "name": "short-grain rice",
          "amount": "3",
          "unit": "cups"
        },
        {
          "name": "seaweed sheets (gim)",
          "amount": "5",
          "unit": "sheets"
        },
        {
          "name": "carrots",
          "amount": "1-2",
          "unit": ""
        },
        {
          "name": "cucumber",
          "amount": "1",
          "unit": ""
        },
        {
          "name": "eggs",
          "amount": "3-4",
          "unit": ""
        },
        {
          "name": "pickled yellow radish (danmuji)",
          "amount": "1",
          "unit": "package"
        },
        {
          "name": "imitation crab sticks (optional)",
          "amount": "1",
          "unit": "package"
        },
        {
          "name": "sesame oil",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "salt",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "sesame seeds",
          "amount": "1",
          "unit": "tbsp"
        }
      ],
      "steps": [
        {
          "description": "Cook rice according to package instructions. While still warm, mix with 1 tbsp sesame oil and 1 tsp salt. Allow to cool slightly."
        },
        {
          "description": "Julienne carrots and sauté for 2-3 minutes with a pinch of salt. Set aside to cool."
        },
        {
          "description": "Julienne cucumber, sprinkle with salt, and after 5 minutes, squeeze out excess water."
        },
        {
          "description": "Beat eggs with a pinch of salt, make thin omelets, and slice into strips."
        },
        {
          "description": "Slice pickled radish into strips."
        },
        {
          "description": "Place a sheet of seaweed on a bamboo mat, shiny side down."
        },
        {
          "description": "Spread about 3/4 cup of rice evenly over the seaweed, leaving a small border at the top."
        },
        {
          "description": "Arrange fillings in lines across the center of the rice."
        },
        {
          "description": "Roll tightly using the bamboo mat, applying gentle pressure."
        },
        {
          "description": "Brush the finished roll with a little sesame oil for shine and flavor."
        },
        {
          "description": "Slice each roll into 8 pieces with a sharp knife."
        }
      ],
      "batchCookingInstructions": "For immediate consumption (1-2 days): Wrap each whole roll tightly in plastic wrap before slicing and refrigerate. For longer storage (2-3 days): Keep the rolls uncut, wrap tightly in plastic wrap, then foil, and refrigerate. Slice only when ready to eat. Don't freeze kimbap as the rice texture will deteriorate.",
      "imageUrl": "/images/kimbap.jpg"
    },
    {
      "id": "ground-beef-bulgogi",
      "name": "Ground Beef Bulgogi Meal Prep Bowls",
      "type": "lunch",
      "description": "This simplified version of traditional bulgogi uses ground beef instead of sliced beef, making it much easier and quicker to prepare. When portioned into meal prep containers with rice and vegetables, it creates a complete, balanced meal that reheats beautifully throughout the week.",
      "prepTime": 20,
      "cookTime": 25,
      "servings": 5,
      "ingredients": [
        {
          "name": "ground beef (85-90% lean)",
          "amount": "1",
          "unit": "lb"
        },
        {
          "name": "onion",
          "amount": "1",
          "unit": ""
        },
        {
          "name": "garlic",
          "amount": "4",
          "unit": "cloves"
        },
        {
          "name": "green onions",
          "amount": "2",
          "unit": ""
        },
        {
          "name": "mushrooms (optional)",
          "amount": "8",
          "unit": "oz"
        },
        {
          "name": "cooked rice",
          "amount": "4",
          "unit": "cups"
        },
        {
          "name": "broccoli florets",
          "amount": "2",
          "unit": "cups"
        },
        {
          "name": "soy sauce",
          "amount": "1/4",
          "unit": "cup"
        },
        {
          "name": "brown sugar",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "mirin (rice wine) or apple juice",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "sesame oil",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "grated ginger",
          "amount": "1",
          "unit": "tsp"
        },
        {
          "name": "black pepper",
          "amount": "1/2",
          "unit": "tsp"
        },
        {
          "name": "toasted sesame seeds",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "gochujang (Korean chili paste, optional)",
          "amount": "1-2",
          "unit": "tsp"
        }
      ],
      "steps": [
        {
          "description": "Cook rice according to package instructions. This can be done while preparing the beef mixture."
        },
        {
          "description": "Steam broccoli florets until just tender (about 4-5 minutes). Immediately rinse with cold water to stop cooking and set aside."
        },
        {
          "description": "In a bowl, mix together soy sauce, brown sugar, mirin, sesame oil, grated ginger, black pepper, and gochujang (if using)."
        },
        {
          "description": "Heat a large skillet over medium-high heat."
        },
        {
          "description": "Add ground beef and break it apart with a spatula as it cooks."
        },
        {
          "description": "When beef is halfway cooked (still some pink), add diced onion, minced garlic, mushrooms (if using), and white parts of green onions."
        },
        {
          "description": "Continue cooking until beef is fully browned and vegetables are soft."
        },
        {
          "description": "Pour in the bulgogi sauce and stir well to combine. Cook for another 2-3 minutes until the sauce thickens slightly."
        },
        {
          "description": "Stir in half the sesame seeds and the green parts of the green onions."
        },
        {
          "description": "Divide cooked rice among 4-5 meal prep containers."
        },
        {
          "description": "Top with a portion of the beef bulgogi mixture."
        },
        {
          "description": "Add a portion of steamed broccoli to each container."
        },
        {
          "description": "Sprinkle with remaining sesame seeds and green onions."
        }
      ],
      "batchCookingInstructions": "Refrigerate: Allow containers to cool before securing lids. Store in the refrigerator for up to 4 days. Freeze: These bowls freeze well for up to 2 months. Thaw overnight in the refrigerator before reheating. Microwave: Heat for 2-3 minutes, stirring halfway through if possible. Stovetop: For best results when reheating from refrigerated (not frozen), empty contents into a small pan and heat over medium heat for about 5 minutes, stirring occasionally.",
      "imageUrl": "/images/ground-beef-bulgogi.jpg"
    },
    {
      "id": "japchae",
      "name": "Japchae (Korean Glass Noodle Stir-Fry)",
      "type": "lunch",
      "description": "Japchae is a colorful and nutritious Korean glass noodle dish loaded with vegetables and protein. It's perfect for batch cooking as it holds up well in the refrigerator and can be enjoyed both hot and cold, making it ideal for weekly meal prepping.",
      "prepTime": 30,
      "cookTime": 20,
      "servings": 5,
      "ingredients": [
        {
          "name": "Korean sweet potato glass noodles (dangmyeon)",
          "amount": "8",
          "unit": "oz"
        },
        {
          "name": "thinly sliced beef (sirloin or ribeye, optional)",
          "amount": "8",
          "unit": "oz"
        },
        {
          "name": "spinach",
          "amount": "4",
          "unit": "cups"
        },
        {
          "name": "carrot",
          "amount": "1",
          "unit": "large"
        },
        {
          "name": "onion",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "bell pepper (red or green)",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "shiitake mushrooms",
          "amount": "6",
          "unit": ""
        },
        {
          "name": "garlic",
          "amount": "3",
          "unit": "cloves"
        },
        {
          "name": "eggs",
          "amount": "2",
          "unit": ""
        },
        {
          "name": "soy sauce",
          "amount": "1/4",
          "unit": "cup"
        },
        {
          "name": "sesame oil",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "sugar",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "vegetable oil",
          "amount": "3",
          "unit": "tbsp"
        },
        {
          "name": "toasted sesame seeds",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "salt",
          "amount": "1",
          "unit": "tsp"
        },
        {
          "name": "black pepper",
          "amount": "1/2",
          "unit": "tsp"
        }
      ],
      "steps": [
        {
          "description": "Soak glass noodles in warm water for 20 minutes until softened. Drain well."
        },
        {
          "description": "Bring a large pot of water to a boil. Add the glass noodles and cook for 3-5 minutes until tender but still chewy. Drain, rinse under cold water, and cut into shorter lengths with scissors."
        },
        {
          "description": "In a bowl, mix 2 tbsp soy sauce, 1 tbsp sesame oil, 1 tbsp sugar, 1 tsp minced garlic, and black pepper. Toss the noodles in this mixture and set aside."
        },
        {
          "description": "For the beef (if using): In a small bowl, mix beef with 1 tbsp soy sauce, 1 tsp sugar, and 1 tsp minced garlic. Let marinate for 10 minutes."
        },
        {
          "description": "Heat 1 tbsp vegetable oil in a large pan over medium-high heat. Add the marinated beef and stir-fry until fully cooked, about 2-3 minutes. Remove and set aside."
        },
        {
          "description": "In the same pan, add a bit more oil and scramble the eggs. Remove and set aside."
        },
        {
          "description": "Still using the same pan, stir-fry each vegetable separately with a pinch of salt: onions until translucent, carrots and bell peppers until slightly softened, mushrooms until browned. Set each aside after cooking."
        },
        {
          "description": "Blanch spinach in boiling water for 30 seconds, drain, rinse under cold water, and squeeze out excess moisture. Season with a pinch of salt and a few drops of sesame oil."
        },
        {
          "description": "In the same large pan, add the seasoned noodles and stir-fry for 2-3 minutes until the sauce is well absorbed."
        },
        {
          "description": "Add all the cooked vegetables, beef, and eggs back to the pan. Toss everything together with the remaining soy sauce and sesame oil."
        },
        {
          "description": "Season with salt and pepper to taste. Sprinkle with toasted sesame seeds before serving."
        }
      ],
      "batchCookingInstructions": "Allow Japchae to cool completely before dividing into airtight containers. Store in the refrigerator for up to 4 days. Japchae can be enjoyed both cold and hot. For reheating, microwave for 1-2 minutes or stir-fry in a pan with a little sesame oil for 2-3 minutes until heated through. For longer storage, Japchae can be frozen for up to 2 months. Thaw overnight in the refrigerator before reheating. Note that the noodles may become slightly softer after freezing and thawing.",
      "imageUrl": "/images/japchae.jpg"
    },
    {
      "id": "tteokbokki",
      "name": "Gungjung Tteokbokki (Royal Korean Rice Cakes)",
      "type": "lunch",
      "description": "Gungjung Tteokbokki is the traditional 'royal court' version of Korean rice cakes, made with a savory soy sauce-based seasoning rather than the spicy version commonly found today. This milder version is perfect for batch cooking and meal prep, offering a delicious and filling lunch option throughout the week.",
      "prepTime": 15,
      "cookTime": 15,
      "servings": 5,
      "ingredients": [
        {
          "name": "Korean rice cakes (tteok)",
          "amount": "1",
          "unit": "lb"
        },
        {
          "name": "thinly sliced beef (optional)",
          "amount": "4",
          "unit": "oz"
        },
        {
          "name": "carrot",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "onion",
          "amount": "1/2",
          "unit": "medium"
        },
        {
          "name": "green onions",
          "amount": "3",
          "unit": ""
        },
        {
          "name": "shiitake mushrooms",
          "amount": "4",
          "unit": ""
        },
        {
          "name": "garlic",
          "amount": "2",
          "unit": "cloves"
        },
        {
          "name": "soy sauce",
          "amount": "3",
          "unit": "tbsp"
        },
        {
          "name": "brown sugar",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "sesame oil",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "vegetable oil",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "beef or vegetable broth",
          "amount": "1",
          "unit": "cup"
        },
        {
          "name": "toasted sesame seeds",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "black pepper",
          "amount": "1/4",
          "unit": "tsp"
        }
      ],
      "steps": [
        {
          "description": "If using frozen rice cakes, soak them in warm water for 15-20 minutes until softened. If using fresh ones, you can skip this step."
        },
        {
          "description": "Julienne the carrot, slice the onion thinly, chop the green onions, and slice the mushrooms."
        },
        {
          "description": "If using beef, cut it into thin strips and marinate with 1 tbsp soy sauce and a pinch of black pepper for 10 minutes."
        },
        {
          "description": "In a small bowl, mix together the sauce: remaining soy sauce, brown sugar, minced garlic, and black pepper."
        },
        {
          "description": "Heat vegetable oil in a large pan or wok over medium-high heat."
        },
        {
          "description": "If using beef, stir-fry it first until cooked through, about 2-3 minutes. Remove and set aside."
        },
        {
          "description": "In the same pan, add a bit more oil if needed and stir-fry the onions and carrots for 2-3 minutes until they begin to soften."
        },
        {
          "description": "Add mushrooms and cook for another 1-2 minutes."
        },
        {
          "description": "Add the softened and drained rice cakes, broth, and the prepared sauce."
        },
        {
          "description": "Cook for about 3-5 minutes, stirring gently until the rice cakes are tender and the sauce has thickened."
        },
        {
          "description": "Return the beef to the pan if using, add the green onions, and cook for another minute, stirring to combine everything."
        },
        {
          "description": "Drizzle with sesame oil and sprinkle with toasted sesame seeds before removing from heat."
        }
      ],
      "batchCookingInstructions": "Allow the tteokbokki to cool completely before dividing into portion-sized containers. Store in the refrigerator for up to 3-4 days. To reheat, add a tablespoon of water or broth to prevent drying, and microwave for 1-2 minutes or gently reheat in a pan. For longer storage, you can freeze portions for up to 1 month. Thaw overnight in the refrigerator before reheating. Note that the texture of the rice cakes may change slightly after freezing, becoming a bit softer when reheated.",
      "imageUrl": "/images/tteokbokki.jpg"
    },
    {
      "id": "bibimbap",
      "name": "Bibimbap Meal Prep Bowls",
      "type": "dinner",
      "description": "Bibimbap (비빔밥), meaning \"mixed rice,\" is a beloved Korean dish consisting of rice topped with seasoned vegetables, protein, and a spicy gochujang sauce. This meal prep version simplifies the traditional recipe while maintaining its nutritional balance and flavors, making it perfect for batch cooking and enjoying throughout the week.",
      "prepTime": 40,
      "cookTime": 30,
      "servings": 5,
      "ingredients": [
        {
          "name": "cooked short-grain rice",
          "amount": "4",
          "unit": "cups"
        },
        {
          "name": "lean ground beef or thinly sliced beef",
          "amount": "8",
          "unit": "oz"
        },
        {
          "name": "spinach",
          "amount": "2",
          "unit": "cups"
        },
        {
          "name": "carrot",
          "amount": "1",
          "unit": "large"
        },
        {
          "name": "zucchini",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "bean sprouts",
          "amount": "1",
          "unit": "cup"
        },
        {
          "name": "eggs",
          "amount": "4-5",
          "unit": ""
        },
        {
          "name": "sesame oil",
          "amount": "3",
          "unit": "tbsp"
        },
        {
          "name": "sesame seeds",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "green onions",
          "amount": "2",
          "unit": ""
        },
        {
          "name": "soy sauce",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "brown sugar",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "minced garlic",
          "amount": "2",
          "unit": "tbsp"
        },
        {
          "name": "grated ginger",
          "amount": "1",
          "unit": "tsp"
        },
        {
          "name": "gochujang (Korean red pepper paste)",
          "amount": "3",
          "unit": "tbsp"
        },
        {
          "name": "sugar or honey",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "rice vinegar",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "water",
          "amount": "1",
          "unit": "tbsp"
        }
      ],
      "steps": [
        {
          "description": "Cook rice according to package instructions. Allow to cool completely before storing in airtight containers."
        },
        {
          "description": "Mix beef marinade: soy sauce, brown sugar, minced garlic, sesame oil, and grated ginger in a bowl."
        },
        {
          "description": "Add ground beef or sliced beef and marinate for at least 15 minutes."
        },
        {
          "description": "Heat a pan over medium-high heat, add the marinated beef, and cook until browned (about 5-7 minutes). Set aside to cool completely."
        },
        {
          "description": "Spinach: Blanch in boiling water for 30 seconds, drain, rinse with cold water, and squeeze out excess moisture. Season with 1 tsp sesame oil, 1/2 tsp salt, and 1 tsp minced garlic."
        },
        {
          "description": "Carrots: Sauté julienned carrots in 1 tsp sesame oil for 2-3 minutes with a pinch of salt."
        },
        {
          "description": "Zucchini: Sauté julienned zucchini in 1 tsp sesame oil for 2-3 minutes with a pinch of salt."
        },
        {
          "description": "Bean sprouts: Blanch in boiling water for 2 minutes, drain, rinse with cold water. Season with 1 tsp sesame oil, 1/2 tsp salt, and 1 tsp minced garlic."
        },
        {
          "description": "Make gochujang sauce: Mix gochujang, sugar or honey, sesame oil, water, rice vinegar, and minced garlic in a bowl until well combined."
        },
        {
          "description": "For batch prep, store rice, cooked beef, and each vegetable in separate containers. Alternatively, divide rice among meal prep containers, add beef and arranged vegetables on top (keeping each component separate). Store sauce separately."
        }
      ],
      "batchCookingInstructions": "Refrigerate all components in airtight containers for up to 4-5 days. The sauce will keep for up to a week refrigerated. For extended storage, rice, beef, and blanched vegetables can be frozen separately for up to 2 months. When ready to serve, assemble the bowl with rice on the bottom, vegetables arranged on top, and beef in the center. Heat the assembled bowl in the microwave for 1-2 minutes if desired. Fry an egg (sunny-side up is traditional) and place on top of the heated bowl. Drizzle with gochujang sauce, sprinkle with sesame seeds and green onions. Mix everything together thoroughly before eating.",
      "imageUrl": "/images/bibimbap.jpg"
    },
    {
      "id": "doenjang-jjigae",
      "name": "Doenjang Jjigae (Korean Soybean Paste Stew)",
      "type": "dinner",
      "description": "Doenjang Jjigae is a hearty, comforting Korean stew made with fermented soybean paste (doenjang), tofu, and vegetables. It's a staple in Korean cuisine and perfect for batch cooking as the flavors actually improve after a day or two, making it ideal for weekly meal preparation.",
      "prepTime": 15,
      "cookTime": 30,
      "servings": 5,
      "ingredients": [
        {
          "name": "doenjang (Korean fermented soybean paste)",
          "amount": "4",
          "unit": "tbsp"
        },
        {
          "name": "gochujang (optional, for spiciness)",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "onion",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "garlic",
          "amount": "2",
          "unit": "cloves"
        },
        {
          "name": "vegetable oil",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "zucchini",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "potato",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "firm tofu",
          "amount": "14",
          "unit": "oz"
        },
        {
          "name": "green onions",
          "amount": "2",
          "unit": ""
        },
        {
          "name": "water or anchovy-kelp stock",
          "amount": "6",
          "unit": "cups"
        },
        {
          "name": "mushrooms (shiitake or button)",
          "amount": "8",
          "unit": "oz"
        },
        {
          "name": "Korean chili pepper (optional)",
          "amount": "1",
          "unit": ""
        }
      ],
      "steps": [
        {
          "description": "Heat vegetable oil in a large pot over medium heat."
        },
        {
          "description": "Add onions and garlic, sautéing until translucent (about 3-4 minutes)."
        },
        {
          "description": "Add potatoes and cook for 2-3 minutes."
        },
        {
          "description": "Add water or stock to the pot and bring to a boil."
        },
        {
          "description": "Reduce heat to medium-low and add doenjang paste, dissolving it into the broth."
        },
        {
          "description": "If using gochujang, add it now and stir well."
        },
        {
          "description": "Add zucchini and mushrooms, simmer for 5 minutes."
        },
        {
          "description": "Add tofu cubes carefully to avoid breaking them."
        },
        {
          "description": "Simmer for another 10-15 minutes until potatoes are soft and flavors are well-combined."
        },
        {
          "description": "In the last minute of cooking, add green onions and Korean chili pepper if using."
        },
        {
          "description": "Allow the stew to cool completely before transferring to storage containers."
        },
        {
          "description": "Divide into portion-sized containers for easy reheating."
        }
      ],
      "batchCookingInstructions": "Refrigerate: Store in airtight containers for up to 5 days. The flavor will actually improve after the first day! Freeze: This stew freezes very well. Portion into freezer-safe containers and freeze for up to 2 months. Thaw overnight in the refrigerator before reheating. To reheat on stovetop (preferred method): Transfer to a small pot and heat over medium heat for 5-7 minutes, stirring occasionally. For microwave: Heat for 2-3 minutes, stirring halfway through. Serve hot with a side of fresh steamed rice and kimchi.",
      "imageUrl": "/images/doenjang-jjigae.jpg"
    },
    {
      "id": "kimchi-jjigae",
      "name": "Kimchi Jjigae (Kimchi Stew)",
      "type": "dinner",
      "description": "Kimchi Jjigae is a spicy, flavorful Korean stew made with aged kimchi, pork belly, and tofu. It's one of Korea's most beloved comfort foods and perfect for batch cooking since the flavors deepen over time, making it an excellent option for weekly meal prep.",
      "prepTime": 15,
      "cookTime": 30,
      "servings": 5,
      "ingredients": [
        {
          "name": "aged kimchi (at least 2 weeks old)",
          "amount": "2",
          "unit": "cups"
        },
        {
          "name": "kimchi juice",
          "amount": "1/2",
          "unit": "cup"
        },
        {
          "name": "pork belly (sliced)",
          "amount": "1/2",
          "unit": "lb"
        },
        {
          "name": "firm tofu",
          "amount": "14",
          "unit": "oz"
        },
        {
          "name": "onion",
          "amount": "1",
          "unit": "medium"
        },
        {
          "name": "green onions",
          "amount": "2",
          "unit": ""
        },
        {
          "name": "garlic",
          "amount": "3",
          "unit": "cloves"
        },
        {
          "name": "gochugaru (Korean red pepper flakes)",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "gochujang (Korean red pepper paste)",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "vegetable oil",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "water or anchovy stock",
          "amount": "3",
          "unit": "cups"
        },
        {
          "name": "sugar",
          "amount": "1",
          "unit": "tsp"
        },
        {
          "name": "fish sauce or soy sauce",
          "amount": "1",
          "unit": "tbsp"
        },
        {
          "name": "sesame oil",
          "amount": "1",
          "unit": "tsp"
        },
        {
          "name": "sesame seeds",
          "amount": "1",
          "unit": "tsp"
        }
      ],
      "steps": [
        {
          "description": "Chop kimchi into bite-sized pieces and set aside. Reserve the kimchi juice."
        },
        {
          "description": "Heat vegetable oil in a large pot over medium heat. Add sliced pork belly and cook until it starts to render its fat, about 3-4 minutes."
        },
        {
          "description": "Add chopped kimchi, gochujang, gochugaru, and sugar. Stir-fry for about 3-5 minutes until the kimchi becomes translucent and the mixture is well combined and fragrant."
        },
        {
          "description": "Add the kimchi juice, water or stock, and sliced onions. Bring to a boil, then reduce heat and simmer for about 15 minutes with the lid on."
        },
        {
          "description": "While the stew is simmering, cut the tofu into 1/2-inch thick slices or cubes."
        },
        {
          "description": "Add the tofu to the stew carefully to avoid breaking the pieces. Simmer for another 5 minutes."
        },
        {
          "description": "Taste and adjust seasoning if needed, adding fish sauce or soy sauce for saltiness."
        },
        {
          "description": "Just before serving, add chopped green onions and a drizzle of sesame oil."
        },
        {
          "description": "Sprinkle with sesame seeds."
        },
        {
          "description": "Allow the stew to cool completely before dividing into portion-sized containers for meal prep."
        }
      ],
      "batchCookingInstructions": "Refrigerate: Store in airtight containers for up to 5 days. The flavor will actually improve and mellow after a day or two! Freeze: This stew freezes well. Portion into freezer-safe containers and freeze for up to 2 months. Thaw overnight in the refrigerator before reheating. Reheating: On stovetop (preferred method): Transfer to a small pot and heat over medium heat for 5-7 minutes, stirring occasionally. For microwave: Heat for 2-3 minutes, stirring halfway through. Serve hot with freshly cooked white rice. For a complete meal, you can add a fried egg on top when reheating.",
      "imageUrl": "/images/kimchi-jjigae.jpg"
    }
  ],
  "weeklyMealPlans": [
    {
      "id": 1,
      "weekNumber": 1,
      "lunchRecipeId": "kimbap",
      "dinnerRecipeId": "bibimbap"
    },
    {
      "id": 2,
      "weekNumber": 2,
      "lunchRecipeId": "ground-beef-bulgogi",
      "dinnerRecipeId": "doenjang-jjigae"
    },
    {
      "id": 3,
      "weekNumber": 3,
      "lunchRecipeId": "japchae",
      "dinnerRecipeId": "kimchi-jjigae"
    },
    {
      "id": 4,
      "weekNumber": 4,
      "lunchRecipeId": "tteokbokki",
      "dinnerRecipeId": "bibimbap"
    }
  ]
}